In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series

In [3]:
from pandas import DataFrame

In [4]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
from numpy import nan as NA

data = pd.Series([1,NA,3.5,NA,7])

In [11]:
data.dropna() #dropping all values that are not NULL or NaN

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]#showing all values that are not NULL or NaN

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                    [NA,NA,NA],[NA,6.5,3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned = data.dropna()

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4]=NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  1.282282 -0.721653  1.027038
1 -0.761979 -0.609137  1.138978
2  1.620162  0.846792  0.861850
3  0.212855 -2.186913 -1.844578
4  0.056997 -1.146113 -0.911032
5 -0.777884 -0.446182 -0.549075
6 -1.203096  0.587707 -0.258299

In [27]:
df.iloc[:4,1] = NA

In [28]:
df.iloc[:2,2] = NA

In [29]:
df

          0         1         2
0  1.282282       NaN       NaN
1 -0.761979       NaN       NaN
2  1.620162       NaN  0.861850
3  0.212855       NaN -1.844578
4  0.056997 -1.146113 -0.911032
5 -0.777884 -0.446182 -0.549075
6 -1.203096  0.587707 -0.258299

In [30]:
df.dropna()

          0         1         2
4  0.056997 -1.146113 -0.911032
5 -0.777884 -0.446182 -0.549075
6 -1.203096  0.587707 -0.258299

In [31]:
df.dropna(thresh=2)#keeping some of NA values

          0         1         2
2  1.620162       NaN  0.861850
3  0.212855       NaN -1.844578
4  0.056997 -1.146113 -0.911032
5 -0.777884 -0.446182 -0.549075
6 -1.203096  0.587707 -0.258299

In [32]:
df.fillna(0)#filling with the 0

          0         1         2
0  1.282282  0.000000  0.000000
1 -0.761979  0.000000  0.000000
2  1.620162  0.000000  0.861850
3  0.212855  0.000000 -1.844578
4  0.056997 -1.146113 -0.911032
5 -0.777884 -0.446182 -0.549075
6 -1.203096  0.587707 -0.258299

In [33]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0  1.436526 -1.830903 -0.962689
1  0.590151  0.063680  0.623528
2 -0.977341  0.618484  0.289437
3 -0.297269  0.124944 -0.896739
4  0.138155  0.422747  0.730560
5 -0.660265 -1.292685 -1.755118

In [34]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [35]:
df

          0         1         2
0  1.436526 -1.830903 -0.962689
1  0.590151  0.063680  0.623528
2 -0.977341       NaN  0.289437
3 -0.297269       NaN -0.896739
4  0.138155       NaN       NaN
5 -0.660265       NaN       NaN

In [37]:
df.fillna(method='ffill') # filling with previous values

C:\Users\win11\AppData\Local\Temp\ipykernel_27788\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0  1.436526 -1.830903 -0.962689
1  0.590151  0.063680  0.623528
2 -0.977341  0.063680  0.289437
3 -0.297269  0.063680 -0.896739
4  0.138155  0.063680 -0.896739
5 -0.660265  0.063680 -0.896739

In [38]:
df.fillna(method='ffill',limit = 2)

C:\Users\win11\AppData\Local\Temp\ipykernel_27788\4038505719.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',limit = 2)

          0         1         2
0  1.436526 -1.830903 -0.962689
1  0.590151  0.063680  0.623528
2 -0.977341  0.063680  0.289437
3 -0.297269  0.063680 -0.896739
4  0.138155       NaN -0.896739
5 -0.660265       NaN -0.896739

In [41]:
#Removing Duplicates

In [42]:
data = pd.DataFrame({'k1' : ['one' , 'two'] * 3 + ['two'],
                    'k2' : [1,1,2,3,3,4,4]})

In [43]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [44]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [45]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [46]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [47]:
datas = pd.DataFrame({'food' : ['bacon','pulled_pork','bacon',
                               'Pastraml','corned beef','Bacon',
                               'pastraml','honey ham','nova lox'],
                     'ounces' : [4,3,12,6,7.5,8,3,5,6]})

meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastraml' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [48]:
lowercased = datas['food'].str.lower()
lowercased

0          bacon
1    pulled_pork
2          bacon
3       pastraml
4    corned beef
5          bacon
6       pastraml
7      honey ham
8       nova lox
Name: food, dtype: object

In [49]:
datas['animal'] = lowercased.map(meat_to_animal)

In [50]:
datas

          food  ounces  animal
0        bacon     4.0     pig
1  pulled_pork     3.0     NaN
2        bacon    12.0     pig
3     Pastraml     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastraml     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
data = pd.DataFrame(
    np.arange(12).reshape((3, 4)),
    index=['Ohio', 'Colorado', 'New York'],
    columns=['one', 'two', 'three', 'four']
)
transform = lambda x: x[:4].upper()

In [54]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [57]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [55]:
data.index = data.index.map(transform)

In [56]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [58]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [64]:
#Discretization and Binning

In [65]:
ages = [20,22,25,27,21,23,37,31,61,45,41,43]

In [66]:
bins = [18,25,35,60,100]

In [67]:
cats = pd.cut(ages,bins)

In [68]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (35, 60]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [69]:
pd.value_counts(cats)

C:\Users\win11\AppData\Local\Temp\ipykernel_27788\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(35, 60]     4
(25, 35]     2
(60, 100]    1
Name: count, dtype: int64

In [70]:
nums = pd.DataFrame(np.random.randn(1000,4))

In [71]:
nums.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.041970     0.037149    -0.015659    -0.018034
std       1.000226     1.033698     0.953981     1.003194
min      -3.125609    -3.288545    -3.110939    -3.626973
25%      -0.689587    -0.713096    -0.633527    -0.653202
50%       0.001907     0.054989    -0.047112    -0.058821
75%       0.630694     0.674309     0.622387     0.614208
max       3.075201     3.115734     3.329861     3.166287

In [72]:
col = nums[2]

In [73]:
col[np.abs(col)>3]

197   -3.110939
483    3.329861
648    3.079257
Name: 2, dtype: float64

In [74]:
#Permutation and Random Sampling

In [75]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [76]:
sampler = np.random.permutation(5)

In [77]:
sampler

array([0, 1, 3, 2, 4])

In [78]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [79]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19